api_todo/app/controllers/todos_controller.rb

INSERT INTO "todos" ("task", "created_at", "updated_at") VALUES (?, ?, ?)  [["task", "Example"], ["created_at", "2021-11-20 01:02:33.789059"], ["updated_at", "2021-11-20 01:02:33.789059"]]
---
  def create
    @todo = Todo.new(todo_params)

    if @todo.save